XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
/****************************************************************
 * Copyright (C) 2016, XinLi, all right reserved.
 * File name:    USART.c
 * Date:         2016.03.22
 * Description:  USART Driver
*****************************************************************/

/****************************************************************
 *                        Header include
*****************************************************************/
#include "USART.h"
#include <string.h>

/****************************************************************
 *                       Global variables
*****************************************************************/
#if USART1_BufferSize_Tx
static uint8_t USART1_Buffer_Tx[USART1_BufferSize_Tx] = {NULL};
#endif /* USART1_BufferSize_Tx */
#if USART1_BufferSize_Rx
static uint8_t USART1_Buffer_Rx[USART1_BufferSize_Rx] = {NULL};
#endif /* USART1_BufferSize_Rx */

#if USART2_BufferSize_Tx
static uint8_t USART2_Buffer_Tx[USART2_BufferSize_Tx] = {NULL};
#endif /* USART2_BufferSize_Tx */
#if USART2_BufferSize_Rx
static uint8_t USART2_Buffer_Rx[USART2_BufferSize_Rx] = {NULL};
#endif /* USART2_BufferSize_Rx */

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
#if USART3_BufferSize_Tx
static uint8_t USART3_Buffer_Tx[USART3_BufferSize_Tx] = {NULL};
#endif /* USART3_BufferSize_Tx */
#if USART3_BufferSize_Rx
static uint8_t USART3_Buffer_Rx[USART3_BufferSize_Rx] = {NULL};
#endif /* USART3_BufferSize_Rx */
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
#if USART4_BufferSize_Tx
static uint8_t USART4_Buffer_Tx[USART4_BufferSize_Tx] = {NULL};
#endif /* USART4_BufferSize_Tx */
#if USART4_BufferSize_Rx
static uint8_t USART4_Buffer_Rx[USART4_BufferSize_Rx] = {NULL};
#endif /* USART4_BufferSize_Rx */

#if USART5_BufferSize_Tx
static uint8_t USART5_Buffer_Tx[USART5_BufferSize_Tx] = {NULL};
#endif /* USART5_BufferSize_Tx */
#if USART5_BufferSize_Rx
static uint8_t USART5_Buffer_Rx[USART5_BufferSize_Rx] = {NULL};
#endif /* USART5_BufferSize_Rx */
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */

#if USART6_BufferSize_Tx
static uint8_t USART6_Buffer_Tx[USART6_BufferSize_Tx] = {NULL};
#endif /* USART6_BufferSize_Tx */
#if USART6_BufferSize_Rx
static uint8_t USART6_Buffer_Rx[USART6_BufferSize_Rx] = {NULL};
#endif /* USART6_BufferSize_Rx */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
#if USART7_BufferSize_Tx
static uint8_t USART7_Buffer_Tx[USART7_BufferSize_Tx] = {NULL};
#endif /* USART7_BufferSize_Tx */
#if USART7_BufferSize_Rx
static uint8_t USART7_Buffer_Rx[USART7_BufferSize_Rx] = {NULL};
#endif /* USART7_BufferSize_Rx */

#if USART8_BufferSize_Tx
static uint8_t USART8_Buffer_Tx[USART8_BufferSize_Tx] = {NULL};
#endif /* USART8_BufferSize_Tx */
#if USART8_BufferSize_Rx
static uint8_t USART8_Buffer_Rx[USART8_BufferSize_Rx] = {NULL};
#endif /* USART8_BufferSize_Rx */
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */

#if defined(STM32F413_423xx)
#if USART9_BufferSize_Tx
static uint8_t USART9_Buffer_Tx[USART9_BufferSize_Tx] = {NULL};
#endif /* USART9_BufferSize_Tx */
#if USART9_BufferSize_Rx
static uint8_t USART9_Buffer_Rx[USART9_BufferSize_Rx] = {NULL};
#endif /* USART9_BufferSize_Rx */

#if USART10_BufferSize_Tx
static uint8_t USART10_Buffer_Tx[USART10_BufferSize_Tx] = {NULL};
#endif /* USART10_BufferSize_Tx */
#if USART10_BufferSize_Rx
static uint8_t USART10_Buffer_Rx[USART10_BufferSize_Rx] = {NULL};
#endif /* USART10_BufferSize_Rx */
#endif /* STM32F413_423xx */

static uint16_t gpioFlag  = NULL; /* Used to record the GPIO initialization flag. */
static uint16_t usartFlag = NULL; /* Used to record the USART initialization flag. */
static uint16_t dmaTxFlag = NULL; /* Used to record the DMA TX initialization flag. */
static uint16_t dmaRxFlag = NULL; /* Used to record the DMA RX initialization flag. */
static uint16_t firstFlag = NULL; /* Used to record the USART first send data flag. */

/****************************************************************
 *                     Function declaration
*****************************************************************/
static void USART_DMA_TX_Configuration(USART_TypeDef* USARTx);
static void USART_DMA_RX_Configuration(USART_TypeDef* USARTx);
static void USART_DMA_TX_Unconfigure(USART_TypeDef* USARTx);
static void USART_DMA_RX_Unconfigure(USART_TypeDef* USARTx);

/****************************************************************
 *                     Function definition
*****************************************************************/

/****************************************************************
 * Function:    USART_Configuration
 * Description: USART Configuration.
 * Input:       USARTx
 *              BaudRate
 *              USART_IT
 * Output:
 * Return:
*****************************************************************/
void USART_Configuration(USART_TypeDef* USARTx, uint32_t BaudRate, uint16_t USART_IT)
{
  uint16_t USART_Mode = NULL;
  
  GPIO_InitTypeDef GPIO_InitStructure;
  USART_InitTypeDef USART_InitStructure;
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx || USART1_BufferSize_Rx
#if USART1_BufferSize_Tx && USART1_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART1_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART1_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART1_BufferSize_Rx */
#endif /* USART1_BufferSize_Tx */
#endif /* USART1_BufferSize_Tx && USART1_BufferSize_Rx */
#else
    return;
#endif /* USART1_BufferSize_Tx || USART1_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx || USART2_BufferSize_Rx
#if USART2_BufferSize_Tx && USART2_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART2_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART2_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART2_BufferSize_Rx */
#endif /* USART2_BufferSize_Tx */
#endif /* USART2_BufferSize_Tx && USART2_BufferSize_Rx */
#else
    return;
#endif /* USART2_BufferSize_Tx || USART2_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx || USART3_BufferSize_Rx
#if USART3_BufferSize_Tx && USART3_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART3_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART3_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART3_BufferSize_Rx */
#endif /* USART3_BufferSize_Tx */
#endif /* USART3_BufferSize_Tx && USART3_BufferSize_Rx */
#else
    return;
#endif /* USART3_BufferSize_Tx || USART3_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx || USART4_BufferSize_Rx
#if USART4_BufferSize_Tx && USART4_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART4_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART4_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART4_BufferSize_Rx */
#endif /* USART4_BufferSize_Tx */
#endif /* USART4_BufferSize_Tx && USART4_BufferSize_Rx */
#else
    return;
#endif /* USART4_BufferSize_Tx || USART4_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx || USART5_BufferSize_Rx
#if USART5_BufferSize_Tx && USART5_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART5_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART5_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART5_BufferSize_Rx */
#endif /* USART5_BufferSize_Tx */
#endif /* USART5_BufferSize_Tx && USART5_BufferSize_Rx */
#else
    return;
#endif /* USART5_BufferSize_Tx || USART5_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx || USART6_BufferSize_Rx
#if USART6_BufferSize_Tx && USART6_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART6_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART6_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART6_BufferSize_Rx */
#endif /* USART6_BufferSize_Tx */
#endif /* USART6_BufferSize_Tx && USART6_BufferSize_Rx */
#else
    return;
#endif /* USART6_BufferSize_Tx || USART6_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx || USART7_BufferSize_Rx
#if USART7_BufferSize_Tx && USART7_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART7_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART7_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART7_BufferSize_Rx */
#endif /* USART7_BufferSize_Tx */
#endif /* USART7_BufferSize_Tx && USART7_BufferSize_Rx */
#else
    return;
#endif /* USART7_BufferSize_Tx || USART7_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx || USART8_BufferSize_Rx
#if USART8_BufferSize_Tx && USART8_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART8_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART8_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART8_BufferSize_Rx */
#endif /* USART8_BufferSize_Tx */
#endif /* USART8_BufferSize_Tx && USART8_BufferSize_Rx */
#else
    return;
#endif /* USART8_BufferSize_Tx || USART8_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx || USART9_BufferSize_Rx
#if USART9_BufferSize_Tx && USART9_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART9_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART9_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART9_BufferSize_Rx */
#endif /* USART9_BufferSize_Tx */
#endif /* USART9_BufferSize_Tx && USART9_BufferSize_Rx */
#else
    return;
#endif /* USART9_BufferSize_Tx || USART9_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx || USART10_BufferSize_Rx
#if USART10_BufferSize_Tx && USART10_BufferSize_Rx
    USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
#else
#if USART10_BufferSize_Tx
    USART_Mode = USART_Mode_Tx;
#else
#if USART10_BufferSize_Rx
    USART_Mode = USART_Mode_Rx;
#endif /* USART10_BufferSize_Rx */
#endif /* USART10_BufferSize_Tx */
#endif /* USART10_BufferSize_Tx && USART10_BufferSize_Rx */
#else
    return;
#endif /* USART10_BufferSize_Tx || USART10_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */

  if(USARTx == USART1)
  {
    firstFlag &= 0xFFFE;
    
