XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if( (usartFlag & 0x0100) != 0x0100 )
    {
      usartFlag |= 0x0100;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_UART9, ENABLE); /* Enable USART9 clock */
    }
    
    if( (gpioFlag & 0x0100) != 0x0100 )
    {
      gpioFlag |= 0x0100;
      
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART9_Tx, ENABLE);  /* Enable USART9_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART9_Rx, ENABLE);  /* Enable USART9_Rx GPIO clock */
      
      GPIO_PinAFConfig(GPIO_USART9_Tx, GPIO_PinSource_USART9_Tx, GPIO_AF11_UART9);  /* Connect GPIOxn to USART9_Tx */
      GPIO_PinAFConfig(GPIO_USART9_Rx, GPIO_PinSource_USART9_Rx, GPIO_AF11_UART9);  /* Connect GPIOxn to USART9_Rx */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART9_Tx;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(GPIO_USART9_Tx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART9_Rx;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(GPIO_USART9_Rx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
  }
  else if(USARTx == UART10)
  {
    firstFlag &= 0xFDFF;
    
    if( (usartFlag & 0x0200) != 0x0200 )
    {
      usartFlag |= 0x0200;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_UART10, ENABLE);  /* Enable USART10 clock */
    }
    
    if( (gpioFlag & 0x0200) != 0x0200 )
    {
      gpioFlag |= 0x0200;
      
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART10_Tx, ENABLE);  /* Enable USART10_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART10_Rx, ENABLE);  /* Enable USART10_Rx GPIO clock */
      
      GPIO_PinAFConfig(GPIO_USART10_Tx, GPIO_PinSource_USART10_Tx, GPIO_AF11_UART10); /* Connect GPIOxn to USART10_Tx */
      GPIO_PinAFConfig(GPIO_USART10_Rx, GPIO_PinSource_USART10_Rx, GPIO_AF11_UART10); /* Connect GPIOxn to USART10_Rx */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART10_Tx;  /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(GPIO_USART10_Tx, &GPIO_InitStructure);    /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART10_Rx;  /* Specifies the GPIO pins to be configured. */
      GPIO_Init(GPIO_USART10_Rx, &GPIO_InitStructure);    /* Initializes the GPIOx peripheral. */
    }
  }
#endif /* STM32F413_423xx */
  
  USART_DeInit(USARTx);                                                           /* Deinitializes the USARTx peripheral registers to their default reset values. */
  USART_InitStructure.USART_BaudRate = BaudRate;                                  /* This member configures the USART communication baud rate. */
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;                     /* Specifies the number of data bits transmitted or received in a frame. */
  USART_InitStructure.USART_StopBits = USART_StopBits_1;                          /* Specifies the number of stop bits transmitted. */
  USART_InitStructure.USART_Parity = USART_Parity_No;                             /* Specifies the parity mode. */
  USART_InitStructure.USART_Mode = USART_Mode;                                    /* Specifies whether the Receive or Transmit mode is enabled or disabled. */
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; /* Specifies wether the hardware flow control mode is enabled or disabled. */
  USART_Init(USARTx, &USART_InitStructure);                                       /* Initializes the USARTx peripheral. */
  
  if( (USART_Mode & USART_Mode_Tx) == USART_Mode_Tx )
  {
    USART_DMACmd(USARTx, USART_DMAReq_Tx, ENABLE);   /* Enabling the DMA request specified USARTx */
  }
  if( (USART_Mode & USART_Mode_Rx) == USART_Mode_Rx )
  {
    USART_DMACmd(USARTx, USART_DMAReq_Rx, ENABLE);   /* Enabling the DMA request specified USARTx */
  }
  
  if( (USART_IT & USART_IT_PE) == USART_IT_PE )
  {
    USART_ITConfig(USARTx, USART_IT_PE, ENABLE);     /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_TXE) == USART_IT_TXE )
  {
    USART_ITConfig(USARTx, USART_IT_TXE, ENABLE);    /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_TC) == USART_IT_TC )
  {
    USART_ITConfig(USARTx, USART_IT_TC, ENABLE);     /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_RXNE) == USART_IT_RXNE )
  {
    USART_ITConfig(USARTx, USART_IT_RXNE, ENABLE);   /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_ORE_RX) == USART_IT_ORE_RX )
  {
    USART_ITConfig(USARTx, USART_IT_ORE_RX, ENABLE); /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_IDLE) == USART_IT_IDLE )
  {
    USART_ITConfig(USARTx, USART_IT_IDLE, ENABLE);   /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_LBD) == USART_IT_LBD )
  {
    USART_ITConfig(USARTx, USART_IT_LBD, ENABLE);    /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_CTS) == USART_IT_CTS )
  {
    USART_ITConfig(USARTx, USART_IT_CTS, ENABLE);    /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_ERR) == USART_IT_ERR )
  {
    USART_ITConfig(USARTx, USART_IT_ERR, ENABLE);    /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_ORE_ER) == USART_IT_ORE_ER )
  {
    USART_ITConfig(USARTx, USART_IT_ORE_ER, ENABLE); /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_NE) == USART_IT_NE )
  {
    USART_ITConfig(USARTx, USART_IT_NE, ENABLE);     /* Enabling interrupts specified USARTx */
  }
  if( (USART_IT & USART_IT_FE) == USART_IT_FE )
  {
    USART_ITConfig(USARTx, USART_IT_FE, ENABLE);     /* Enabling interrupts specified USARTx */
  }
  
  USART_Cmd(USARTx, ENABLE);                         /* Enables or disables the specified USARTx peripheral. */
  
  if( USART_Mode == USART_Mode_Tx )
  {
    USART_DMA_TX_Configuration(USARTx); /* Configuration USARTx DMA TX */
    USART_DMA_RX_Unconfigure(USARTx);   /* Unconfigure USARTx DMA RX */
  }
  else if( USART_Mode == USART_Mode_Rx )
  {
    USART_DMA_RX_Configuration(USARTx); /* Configuration USARTx DMA RX */
    USART_DMA_TX_Unconfigure(USARTx);   /* Unconfigure USARTx DMA TX */
  }
  else
  {
    USART_DMA_TX_Configuration(USARTx); /* Configuration USARTx DMA TX */
    USART_DMA_RX_Configuration(USARTx); /* Configuration USARTx DMA RX */
  }
}

/****************************************************************
 * Function:    USART_Unconfigure
 * Description: USART Unconfigure.
 * Input:       USARTx
 * Output:
 * Return:
*****************************************************************/
void USART_Unconfigure(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx || USART1_BufferSize_Rx
    firstFlag &= 0xFFFE;
    
