XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if( (usartFlag & 0x0001) == 0x0001 )
    {
      usartFlag &= 0xFFFE;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE); /* Disable USART1 clock */
      
      USART_DeInit(USART1); /* Deinitializes the USART1 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART1); /* Unconfigure USART1 DMA TX */
      USART_DMA_RX_Unconfigure(USART1); /* Unconfigure USART1 DMA RX */
    }
#endif /* USART1_BufferSize_Tx || USART1_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx || USART2_BufferSize_Rx
    firstFlag &= 0xFFFD;
    
    if( (usartFlag & 0x0002) == 0x0002 )
    {
      usartFlag &= 0xFFFD;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, DISABLE); /* Disable USART2 clock */
      
      USART_DeInit(USART2); /* Deinitializes the USART2 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART2); /* Unconfigure USART2 DMA TX */
      USART_DMA_RX_Unconfigure(USART2); /* Unconfigure USART2 DMA RX */
    }
#endif /* USART2_BufferSize_Tx || USART2_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx || USART3_BufferSize_Rx
    firstFlag &= 0xFFFB;
    
    if( (usartFlag & 0x0004) == 0x0004 )
    {
      usartFlag &= 0xFFFB;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, DISABLE); /* Disable USART3 clock */
      
      USART_DeInit(USART3); /* Deinitializes the USART3 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART3); /* Unconfigure USART3 DMA TX */
      USART_DMA_RX_Unconfigure(USART3); /* Unconfigure USART3 DMA RX */
    }
#endif /* USART3_BufferSize_Tx || USART3_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx || USART4_BufferSize_Rx
    firstFlag &= 0xFFF7;
    
    if( (usartFlag & 0x0008) == 0x0008 )
    {
      usartFlag &= 0xFFF7;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, DISABLE);  /* Disable USART4 clock */
      
      USART_DeInit(UART4); /* Deinitializes the USART4 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART4); /* Unconfigure USART4 DMA TX */
      USART_DMA_RX_Unconfigure(UART4); /* Unconfigure USART4 DMA RX */
    }
#endif /* USART4_BufferSize_Tx || USART4_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx || USART5_BufferSize_Rx
    firstFlag &= 0xFFEF;
    
    if( (usartFlag & 0x0010) == 0x0010 )
    {
      usartFlag &= 0xFFEF;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, DISABLE);  /* Disable USART5 clock */
      
      USART_DeInit(UART5); /* Deinitializes the USART5 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART5); /* Unconfigure USART5 DMA TX */
      USART_DMA_RX_Unconfigure(UART5); /* Unconfigure USART5 DMA RX */
    }
#endif /* USART5_BufferSize_Tx || USART5_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx || USART6_BufferSize_Rx
    firstFlag &= 0xFFDF;
    
    if( (usartFlag & 0x0020) == 0x0020 )
    {
      usartFlag &= 0xFFDF;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, DISABLE); /* Disable USART6 clock */
      
      USART_DeInit(USART6); /* Deinitializes the USART6 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART6); /* Unconfigure USART6 DMA TX */
      USART_DMA_RX_Unconfigure(USART6); /* Unconfigure USART6 DMA RX */
    }
#endif /* USART6_BufferSize_Tx || USART6_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx || USART7_BufferSize_Rx
    firstFlag &= 0xFFBF;
    
    if( (usartFlag & 0x0040) == 0x0040 )
    {
      usartFlag &= 0xFFBF;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART7, DISABLE);  /* Disable USART7 clock */
      
      USART_DeInit(UART7); /* Deinitializes the USART7 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART7); /* Unconfigure USART7 DMA TX */
      USART_DMA_RX_Unconfigure(UART7); /* Unconfigure USART7 DMA RX */
    }
#endif /* USART7_BufferSize_Tx || USART7_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx || USART8_BufferSize_Rx
    firstFlag &= 0xFF7F;
    
    if( (usartFlag & 0x0080) == 0x0080 )
    {
      usartFlag &= 0xFF7F;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART8, DISABLE);  /* Disable USART8 clock */
      
      USART_DeInit(UART8); /* Deinitializes the USART8 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART8); /* Unconfigure USART8 DMA TX */
      USART_DMA_RX_Unconfigure(UART8); /* Unconfigure USART8 DMA RX */
    }
#endif /* USART8_BufferSize_Tx || USART8_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx || USART9_BufferSize_Rx
    firstFlag &= 0xFEFF;
    
    if( (usartFlag & 0x0100) == 0x0100 )
    {
      usartFlag &= 0xFEFF;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_UART9, DISABLE);  /* Disable USART9 clock */
      
      USART_DeInit(UART9); /* Deinitializes the USART9 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(UART9); /* Unconfigure USART9 DMA TX */
      USART_DMA_RX_Unconfigure(UART9); /* Unconfigure USART9 DMA RX */
    }
#endif /* USART9_BufferSize_Tx || USART9_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx || USART10_BufferSize_Rx
    firstFlag &= 0xFDFF;
    
    if( (usartFlag & 0x0200) == 0x0200 )
    {
      usartFlag &= 0xFDFF;
      
