XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
      DMA_DeInit(DMA1_Stream3);                           /* Deinitialize the DMA1 Stream3 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream3) != DISABLE ); /* Wait for the specified DMA1 Stream3 reset to complete. */
    }
#endif /* USART3_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx
    if( (dmaTxFlag & 0x0008) == 0x0008 )
    {
      dmaTxFlag &= 0xFFF7;
      
      DMA_DeInit(DMA1_Stream4);                           /* Deinitialize the DMA1 Stream4 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream4) != DISABLE ); /* Wait for the specified DMA1 Stream4 reset to complete. */
    }
#endif /* USART4_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx
    if( (dmaTxFlag & 0x0010) == 0x0010 )
    {
      dmaTxFlag &= 0xFFEF;
      
      DMA_DeInit(DMA1_Stream7);                           /* Deinitialize the DMA1 Stream7 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream7) != DISABLE ); /* Wait for the specified DMA1 Stream7 reset to complete. */
    }
#endif /* USART5_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx
    if( (dmaTxFlag & 0x0020) == 0x0020 )
    {
      dmaTxFlag &= 0xFFDF;
      
      DMA_DeInit(DMA2_Stream6);                           /* Deinitialize the DMA2 Stream6 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream6) != DISABLE ); /* Wait for the specified DMA2 Stream6 reset to complete. */
    }
#endif /* USART6_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx
    if( (dmaTxFlag & 0x0040) == 0x0040 )
    {
      dmaTxFlag &= 0xFFBF;
      
      DMA_DeInit(DMA1_Stream1);                           /* Deinitialize the DMA1 Stream1 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream1) != DISABLE ); /* Wait for the specified DMA1 Stream1 reset to complete. */
    }
#endif /* USART7_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx
    if( (dmaTxFlag & 0x0080) == 0x0080 )
    {
      dmaTxFlag &= 0xFF7F;
      
      DMA_DeInit(DMA1_Stream0);                           /* Deinitialize the DMA1 Stream0 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream0) != DISABLE ); /* Wait for the specified DMA1 Stream0 reset to complete. */
    }
#endif /* USART8_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx
    if( (dmaTxFlag & 0x0100) == 0x0100 )
    {
      dmaTxFlag &= 0xFEFF;
      
      DMA_DeInit(DMA2_Stream0);                           /* Deinitialize the DMA2 Stream0 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream0) != DISABLE ); /* Wait for the specified DMA2 Stream0 reset to complete. */
    }
#endif /* USART9_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx
    if( (dmaTxFlag & 0x0200) == 0x0200 )
    {
      dmaTxFlag &= 0xFDFF;
      
      DMA_DeInit(DMA2_Stream7);                           /* Deinitialize the DMA2 Stream7 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream7) != DISABLE ); /* Wait for the specified DMA2 Stream7 reset to complete. */
    }
#endif /* USART10_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_DMA_RX_Unconfigure
 * Description: USART DMA RX Unconfigure.
 * Input:       USARTx
 * Output:
 * Return:
*****************************************************************/
static void USART_DMA_RX_Unconfigure(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx
    if( (dmaRxFlag & 0x0001) == 0x0001 )
    {
      dmaRxFlag &= 0xFFFE;
      
      DMA_DeInit(DMA2_Stream2);                           /* Deinitialize the DMA2 Stream2 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream2) != DISABLE ); /* Wait for the specified DMA2 Stream2 reset to complete. */
    }
#endif /* USART1_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx
    if( (dmaRxFlag & 0x0002) == 0x0002 )
    {
      dmaRxFlag &= 0xFFFD;
      
      DMA_DeInit(DMA1_Stream5);                           /* Deinitialize the DMA1 Stream5 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream5) != DISABLE ); /* Wait for the specified DMA1 Stream5 reset to complete. */
    }
#endif /* USART2_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx
    if( (dmaRxFlag & 0x0004) == 0x0004 )
    {
      dmaRxFlag &= 0xFFFB;
      
      DMA_DeInit(DMA1_Stream1);                           /* Deinitialize the DMA1 Stream1 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream1) != DISABLE ); /* Wait for the specified DMA1 Stream1 reset to complete. */
    }
#endif /* USART3_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx
    if( (dmaRxFlag & 0x0008) == 0x0008 )
    {
      dmaRxFlag &= 0xFFF7;
      
      DMA_DeInit(DMA1_Stream2);                           /* Deinitialize the DMA1 Stream2 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream2) != DISABLE ); /* Wait for the specified DMA1 Stream2 reset to complete. */
    }
#endif /* USART4_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx
    if( (dmaRxFlag & 0x0010) == 0x0010 )
    {
      dmaRxFlag &= 0xFFEF;
      
