XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
      DMA_DeInit(DMA1_Stream0);                           /* Deinitialize the DMA1 Stream0 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream0) != DISABLE ); /* Wait for the specified DMA1 Stream0 reset to complete. */
    }
#endif /* USART5_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx
    if( (dmaRxFlag & 0x0020) == 0x0020 )
    {
      dmaRxFlag &= 0xFFDF;
      
      DMA_DeInit(DMA2_Stream1);                           /* Deinitialize the DMA2 Stream1 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream1) != DISABLE ); /* Wait for the specified DMA2 Stream1 reset to complete. */
    }
#endif /* USART6_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx
    if( (dmaRxFlag & 0x0040) == 0x0040 )
    {
      dmaRxFlag &= 0xFFBF;
      
      DMA_DeInit(DMA1_Stream3);                           /* Deinitialize the DMA1 Stream3 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream3) != DISABLE ); /* Wait for the specified DMA1 Stream3 reset to complete. */
    }
#endif /* USART7_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx
    if( (dmaRxFlag & 0x0080) == 0x0080 )
    {
      dmaRxFlag &= 0xFF7F;
      
      DMA_DeInit(DMA1_Stream6);                           /* Deinitialize the DMA1 Stream6 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA1_Stream6) != DISABLE ); /* Wait for the specified DMA1 Stream6 reset to complete. */
    }
#endif /* USART8_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx
    if( (dmaRxFlag & 0x0100) == 0x0100 )
    {
      dmaRxFlag &= 0xFEFF;
      
      DMA_DeInit(DMA2_Stream7);                           /* Deinitialize the DMA2 Stream7 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream7) != DISABLE ); /* Wait for the specified DMA2 Stream7 reset to complete. */
    }
#endif /* USART9_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx
    if( (dmaRxFlag & 0x0200) == 0x0200 )
    {
      dmaRxFlag &= 0xFDFF;
      
      DMA_DeInit(DMA2_Stream0);                           /* Deinitialize the DMA2 Stream0 registers to their default reset values. */
      while( DMA_GetCmdStatus(DMA2_Stream0) != DISABLE ); /* Wait for the specified DMA2 Stream0 reset to complete. */
    }
#endif /* USART10_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_SetSendData
 * Description: USART Set Send Data.
 * Input:       USARTx
                Buffer
                BufferSize
 * Output:
 * Return:      Send Data Number
*****************************************************************/
uint16_t USART_SetSendData(USART_TypeDef* USARTx, void* Buffer, uint16_t BufferSize)
{
  if(BufferSize == NULL)
  {
    return NULL;
  }

  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx
    if( (dmaTxFlag & 0x0001) != 0x0001 )
    {
      return NULL;
    }
    
    if(BufferSize > USART1_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0001) != 0x0001)
    {
      firstFlag |= 0x0001;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA2_Stream7, DMA_FLAG_TCIF7) == RESET );
    }
    
    memcpy(USART1_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);        /* Clears the DMA2 Stream7's pending flags. */
    DMA_Cmd(DMA2_Stream7, DISABLE);                     /* Disables the specified DMA2 Stream7. */
    while( DMA_GetCmdStatus(DMA2_Stream7) != DISABLE ); /* Wait for the specified DMA2 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream7, BufferSize);   /* Writes the number of data units to be transferred on the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);                      /* Enables the specified DMA2 Stream7. */
    
    return BufferSize;
#endif /* USART1_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx
    if( (dmaTxFlag & 0x0002) != 0x0002 )
    {
      return NULL;
    }
    
    if(BufferSize > USART2_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0002) != 0x0002 )
    {
      firstFlag |= 0x0002;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA1_Stream6, DMA_FLAG_TCIF6) == RESET );
    }
    
    memcpy(USART2_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);        /* Clears the DMA1 Stream6's pending flags. */
    DMA_Cmd(DMA1_Stream6, DISABLE);                     /* Disables the specified DMA1 Stream6. */
    while( DMA_GetCmdStatus(DMA1_Stream6) != DISABLE ); /* Wait for the specified DMA1 Stream6 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream6, BufferSize);   /* Writes the number of data units to be transferred on the DMA1 Stream6. */
    DMA_Cmd(DMA1_Stream6, ENABLE);                      /* Enables the specified DMA1 Stream6. */
    
    return BufferSize;
#endif /* USART2_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx
    if( (dmaTxFlag & 0x0004) != 0x0004 )
    {
      return NULL;
    }
    
    if(BufferSize > USART3_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0004) != 0x0004 )
    {
      firstFlag |= 0x0004;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA1_Stream3, DMA_FLAG_TCIF3) == RESET );
    }
    
    memcpy(USART3_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);        /* Clears the DMA1 Stream3's pending flags. */
    DMA_Cmd(DMA1_Stream3, DISABLE);                     /* Disables the specified DMA1 Stream3. */
    while( DMA_GetCmdStatus(DMA1_Stream3) != DISABLE ); /* Wait for the specified DMA1 Stream3 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream3, BufferSize);   /* Writes the number of data units to be transferred on the DMA1 Stream3. */
    DMA_Cmd(DMA1_Stream3, ENABLE);                      /* Enables the specified DMA1 Stream3. */
    
    return BufferSize;
#endif /* USART3_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx
    if( (dmaTxFlag & 0x0008) != 0x0008 )
    {
      return NULL;
    }
    
