XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if(BufferSize > USART4_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0008) != 0x0008 )
    {
      firstFlag |= 0x0008;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA1_Stream4, DMA_FLAG_TCIF4) == RESET );
    }
    
    memcpy(USART4_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);        /* Clears the DMA1 Stream4's pending flags. */
    DMA_Cmd(DMA1_Stream4, DISABLE);                     /* Disables the specified DMA1 Stream4. */
    while( DMA_GetCmdStatus(DMA1_Stream4) != DISABLE ); /* Wait for the specified DMA1 Stream4 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream4, BufferSize);   /* Writes the number of data units to be transferred on the DMA1 Stream4. */
    DMA_Cmd(DMA1_Stream4, ENABLE);                      /* Enables the specified DMA1 Stream4. */
    
    return BufferSize;
#endif /* USART4_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx
    if( (dmaTxFlag & 0x0010) != 0x0010 )
    {
      return NULL;
    }
    
    if(BufferSize > USART5_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0010) != 0x0010 )
    {
      firstFlag |= 0x0010;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA1_Stream7, DMA_FLAG_TCIF7) == RESET );
    }
    
    memcpy(USART5_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);        /* Clears the DMA1 Stream7's pending flags. */
    DMA_Cmd(DMA1_Stream7, DISABLE);                     /* Disables the specified DMA1 Stream7. */
    while( DMA_GetCmdStatus(DMA1_Stream7) != DISABLE ); /* Wait for the specified DMA1 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream7, BufferSize);   /* Writes the number of data units to be transferred on the DMA1 Stream7. */
    DMA_Cmd(DMA1_Stream7, ENABLE);                      /* Enables the specified DMA1 Stream7. */
    
    return BufferSize;
#endif /* USART5_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx
    if( (dmaTxFlag & 0x0020) != 0x0020 )
    {
      return NULL;
    }
    
    if(BufferSize > USART6_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0020) != 0x0020 )
    {
      firstFlag |= 0x0020;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA2_Stream6, DMA_FLAG_TCIF6) == RESET );
    }
    
    memcpy(USART6_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_TCIF6);        /* Clears the DMA2 Stream6's pending flags. */
    DMA_Cmd(DMA2_Stream6, DISABLE);                     /* Disables the specified DMA2 Stream6. */
    while( DMA_GetCmdStatus(DMA2_Stream6) != DISABLE ); /* Wait for the specified DMA2 Stream6 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream6, BufferSize);   /* Writes the number of data units to be transferred on the DMA2 Stream6. */
    DMA_Cmd(DMA2_Stream6, ENABLE);                      /* Enables the specified DMA2 Stream6. */
    
    return BufferSize;
#endif /* USART6_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx
    if( (dmaTxFlag & 0x0040) != 0x0040 )
    {
      return NULL;
    }
    
    if(BufferSize > USART7_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0040) != 0x0040 )
    {
      firstFlag |= 0x0040;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA1_Stream1, DMA_FLAG_TCIF1) == RESET );
    }
    
    memcpy(USART7_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);        /* Clears the DMA1 Stream1's pending flags. */
    DMA_Cmd(DMA1_Stream1, DISABLE);                     /* Disables the specified DMA1 Stream1. */
    while( DMA_GetCmdStatus(DMA1_Stream1) != DISABLE ); /* Wait for the specified DMA1 Stream1 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream1, BufferSize);   /* Writes the number of data units to be transferred on the DMA1 Stream1. */
    DMA_Cmd(DMA1_Stream1, ENABLE);                      /* Enables the specified DMA1 Stream1. */
    
    return BufferSize;
#endif /* USART7_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx
    if( (dmaTxFlag & 0x0080) != 0x0080 )
    {
      return NULL;
    }
    
    if(BufferSize > USART8_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0080) != 0x0080 )
    {
      firstFlag |= 0x0080;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA1_Stream0, DMA_FLAG_TCIF0) == RESET );
    }
    
    memcpy(USART8_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
    DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);        /* Clears the DMA1 Stream0's pending flags. */
    DMA_Cmd(DMA1_Stream0, DISABLE);                     /* Disables the specified DMA1 Stream0. */
    while( DMA_GetCmdStatus(DMA1_Stream0) != DISABLE ); /* Wait for the specified DMA1 Stream0 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream0, BufferSize);   /* Writes the number of data units to be transferred on the DMA1 Stream0. */
    DMA_Cmd(DMA1_Stream0, ENABLE);                      /* Enables the specified DMA1 Stream0. */
    
    return BufferSize;
#endif /* USART8_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx
    if( (dmaTxFlag & 0x0100) != 0x0100 )
    {
      return NULL;
    }
    
    if(BufferSize > USART9_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0100) != 0x0100 )
    {
      firstFlag |= 0x0100;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA2_Stream0, DMA_FLAG_TCIF0) == RESET );
    }
    
    memcpy(USART9_Buffer_Tx, Buffer, BufferSize);       /* Copy memory */
    
