XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);        /* Clears the DMA2 Stream0's pending flags. */
    DMA_Cmd(DMA2_Stream0, DISABLE);                     /* Disables the specified DMA2 Stream0. */
    while( DMA_GetCmdStatus(DMA2_Stream0) != DISABLE ); /* Wait for the specified DMA2 Stream0 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream0, BufferSize);   /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, ENABLE);                      /* Enables the specified DMA2 Stream0. */
    
    return BufferSize;
#endif /* USART9_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx
    if( (dmaTxFlag & 0x0200) != 0x0200 )
    {
      return NULL;
    }
    
    if(BufferSize > USART10_BufferSize_Tx)
    {
      return NULL;
    }
    
    if( (firstFlag & 0x0200) != 0x0200 )
    {
      firstFlag |= 0x0200;
    }
    else
    {
      while( DMA_GetFlagStatus(DMA2_Stream7, DMA_FLAG_TCIF7) == RESET );
    }
    
    memcpy(USART10_Buffer_Tx, Buffer, BufferSize);      /* Copy memory */
    
    DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);        /* Clears the DMA2 Stream7's pending flags. */
    DMA_Cmd(DMA2_Stream7, DISABLE);                     /* Disables the specified DMA2 Stream7. */
    while( DMA_GetCmdStatus(DMA2_Stream7) != DISABLE ); /* Wait for the specified DMA2 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream7, BufferSize);   /* Writes the number of data units to be transferred on the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);                      /* Enables the specified DMA2 Stream7. */
    
    return BufferSize;
#endif /* USART10_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART_GetReceiveData
 * Description: USART Get Receive Data.
 * Input:       USARTx
 *              Buffer
 *              BufferSize
 * Output:
 * Return:      Receive Data Number
*****************************************************************/
uint16_t USART_GetReceiveData(USART_TypeDef* USARTx, void* Buffer, uint16_t BufferSize)
{
  uint16_t number = NULL;
  
  if(BufferSize == NULL)
  {
    return NULL;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx
    if( (dmaRxFlag & 0x0001) != 0x0001 )
    {
      return NULL;
    }
    
    number = USART1_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream2); /* Returns the number of remaining data units in the current DMA2 Stream2 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART1_Buffer_Rx, number);                   /* Copy memory */
    memset(USART1_Buffer_Rx, NULL, USART1_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA2_Stream2, DISABLE);                             /* Disables the specified DMA2 Stream2. */
    while( DMA_GetCmdStatus(DMA2_Stream2) != DISABLE );         /* Wait for the specified DMA2 Stream2 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream2, USART1_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream2. */
    DMA_Cmd(DMA2_Stream2, ENABLE);                              /* Enables the specified DMA2 Stream2. */
#endif /* USART1_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx
    if( (dmaRxFlag & 0x0002) != 0x0002 )
    {
      return NULL;
    }
    
    number = USART2_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream5); /* Returns the number of remaining data units in the current DMA1 Stream5 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART2_Buffer_Rx, number);                   /* Copy memory */
    memset(USART2_Buffer_Rx, NULL, USART2_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA1_Stream5, DISABLE);                             /* Disables the specified DMA1 Stream5. */
    while( DMA_GetCmdStatus(DMA1_Stream5) != DISABLE );         /* Wait for the specified DMA1 Stream5 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream5, USART2_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream5. */
    DMA_Cmd(DMA1_Stream5, ENABLE);                              /* Enables the specified DMA1 Stream5. */
#endif /* USART2_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx
    if( (dmaRxFlag & 0x0004) != 0x0004 )
    {
      return NULL;
    }
    
    number = USART3_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream1); /* Returns the number of remaining data units in the current DMA1 Stream1 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART3_Buffer_Rx, number);                   /* Copy memory */
    memset(USART3_Buffer_Rx, NULL, USART3_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA1_Stream1, DISABLE);                             /* Disables the specified DMA1 Stream1. */
    while( DMA_GetCmdStatus(DMA1_Stream1) != DISABLE );         /* Wait for the specified DMA1 Stream1 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream1, USART3_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
    DMA_Cmd(DMA1_Stream1, ENABLE);                              /* Enables the specified DMA1 Stream1. */
#endif /* USART3_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx
    if( (dmaRxFlag & 0x0008) != 0x0008 )
    {
      return NULL;
    }
    
    number = USART4_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream2); /* Returns the number of remaining data units in the current DMA1 Stream2 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART4_Buffer_Rx, number);                   /* Copy memory */
    memset(USART4_Buffer_Rx, NULL, USART4_BufferSize_Rx);       /* Empty memory */
    
