XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    DMA_Cmd(DMA1_Stream2, DISABLE);                             /* Disables the specified DMA1 Stream2. */
    while( DMA_GetCmdStatus(DMA1_Stream2) != DISABLE );         /* Wait for the specified DMA1 Stream2 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream2, USART4_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream2. */
    DMA_Cmd(DMA1_Stream2, ENABLE);                              /* Enables the specified DMA1 Stream2. */
#endif /* USART4_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx
    if( (dmaRxFlag & 0x0010) != 0x0010 )
    {
      return NULL;
    }
    
    number = USART5_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream0); /* Returns the number of remaining data units in the current DMA1 Stream0 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART5_Buffer_Rx, number);                   /* Copy memory */
    memset(USART5_Buffer_Rx, NULL, USART5_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA1_Stream0, DISABLE);                             /* Disables the specified DMA1 Stream0. */
    while( DMA_GetCmdStatus(DMA1_Stream0) != DISABLE );         /* Wait for the specified DMA1 Stream0 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream0, USART5_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
    DMA_Cmd(DMA1_Stream0, ENABLE);                              /* Enables the specified DMA1 Stream0. */
#endif /* USART5_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx
    if( (dmaRxFlag & 0x0020) != 0x0020 )
    {
      return NULL;
    }
    
    number = USART6_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream1); /* Returns the number of remaining data units in the current DMA2 Stream1 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART6_Buffer_Rx, number);                   /* Copy memory */
    memset(USART6_Buffer_Rx, NULL, USART6_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA2_Stream1, DISABLE);                             /* Disables the specified DMA2 Stream1. */
    while( DMA_GetCmdStatus(DMA2_Stream1) != DISABLE );         /* Wait for the specified DMA2 Stream1 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream1, USART6_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream1. */
    DMA_Cmd(DMA2_Stream1, ENABLE);                              /* Enables the specified DMA2 Stream1. */
#endif /* USART6_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx
    if( (dmaRxFlag & 0x0040) != 0x0040 )
    {
      return NULL;
    }
    
    number = USART7_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream3); /* Returns the number of remaining data units in the current DMA1 Stream3 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART7_Buffer_Rx, number);                   /* Copy memory */
    memset(USART7_Buffer_Rx, NULL, USART7_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA1_Stream3, DISABLE);                             /* Disables the specified DMA1 Stream3. */
    while( DMA_GetCmdStatus(DMA1_Stream3) != DISABLE );         /* Wait for the specified DMA1 Stream3 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream3, USART7_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
    DMA_Cmd(DMA1_Stream3, ENABLE);                              /* Enables the specified DMA1 Stream3. */
#endif /* USART7_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx
    if( (dmaRxFlag & 0x0080) != 0x0080 )
    {
      return NULL;
    }
    
    number = USART8_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream6); /* Returns the number of remaining data units in the current DMA1 Stream6 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART8_Buffer_Rx, number);                   /* Copy memory */
    memset(USART8_Buffer_Rx, NULL, USART8_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA1_Stream6, DISABLE);                             /* Disables the specified DMA1 Stream6. */
    while( DMA_GetCmdStatus(DMA1_Stream6) != DISABLE );         /* Wait for the specified DMA1 Stream6 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream6, USART8_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
    DMA_Cmd(DMA1_Stream6, ENABLE);                              /* Enables the specified DMA1 Stream6. */
#endif /* USART8_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx
    if( (dmaRxFlag & 0x0100) != 0x0100 )
    {
      return NULL;
    }
    
    number = USART9_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream7); /* Returns the number of remaining data units in the current DMA2 Stream7 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART9_Buffer_Rx, number);                   /* Copy memory */
    memset(USART9_Buffer_Rx, NULL, USART9_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA2_Stream7, DISABLE);                             /* Disables the specified DMA2 Stream7. */
    while( DMA_GetCmdStatus(DMA2_Stream7) != DISABLE );         /* Wait for the specified DMA2 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream7, USART9_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);                              /* Enables the specified DMA2 Stream7. */
#endif /* USART9_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx
    if( (dmaRxFlag & 0x0200) != 0x0200 )
    {
      return NULL;
    }
    
    number = USART10_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream0);  /* Returns the number of remaining data units in the current DMA2 Stream0 transfer. */
    
    if(number > BufferSize)
    {
      return NULL;
    }
    
    memcpy(Buffer, USART10_Buffer_Rx, number);                    /* Copy memory */
    memset(USART10_Buffer_Rx, NULL, USART10_BufferSize_Rx);       /* Empty memory */
    
    DMA_Cmd(DMA2_Stream0, DISABLE);                               /* Disables the specified DMA2 Stream0. */
    while( DMA_GetCmdStatus(DMA2_Stream0) != DISABLE );           /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_SetCurrDataCounter(DMA2_Stream0, USART10_BufferSize_Rx);  /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, ENABLE);                                /* Enables the specified DMA2 Stream0. */
#endif /* USART10_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
  
  return number;
}
